# Chapter 7

# Working with Missing Data

In [2]:
import pandas as pd
import numpy as np

In [5]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [6]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [7]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [8]:
float_data = pd.Series([1, 2, None], dtype='float64')

In [9]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [10]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

## Filter Out Missing Data

In [11]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

Those were new objects, to drop within an object, pass axis.

In [18]:
data[4] = np.nan

In [19]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

bad choice for example, it created a 4th column of all nulls then dropped

In [20]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [21]:
df.iloc[:4, 1] = np.nan

In [22]:
df.iloc[:2, 2] = np.nan

In [23]:
df

          0         1         2
0 -0.704829       NaN       NaN
1 -0.869488       NaN       NaN
2 -1.012902       NaN  0.793551
3 -0.911104       NaN -0.710205
4 -0.037348 -1.505042 -0.480043
5 -0.225778 -0.720147  0.477771
6 -0.065548  1.448754  2.107412

In [24]:
df.dropna()

          0         1         2
4 -0.037348 -1.505042 -0.480043
5 -0.225778 -0.720147  0.477771
6 -0.065548  1.448754  2.107412

In [25]:
df.dropna(thresh=2)

          0         1         2
2 -1.012902       NaN  0.793551
3 -0.911104       NaN -0.710205
4 -0.037348 -1.505042 -0.480043
5 -0.225778 -0.720147  0.477771
6 -0.065548  1.448754  2.107412

## Filling In Missing Data

In [26]:
df.fillna(0)

          0         1         2
0 -0.704829  0.000000  0.000000
1 -0.869488  0.000000  0.000000
2 -1.012902  0.000000  0.793551
3 -0.911104  0.000000 -0.710205
4 -0.037348 -1.505042 -0.480043
5 -0.225778 -0.720147  0.477771
6 -0.065548  1.448754  2.107412

In [27]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.704829  0.500000  0.000000
1 -0.869488  0.500000  0.000000
2 -1.012902  0.500000  0.793551
3 -0.911104  0.500000 -0.710205
4 -0.037348 -1.505042 -0.480043
5 -0.225778 -0.720147  0.477771
6 -0.065548  1.448754  2.107412

In [3]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [4]:
df.iloc[2:, 1] = np.nan

In [5]:
df.iloc[4:, 2] = np.nan

In [6]:
df

          0         1         2
0  0.455492  1.862006 -1.377001
1  1.744132 -0.142659  0.654927
2  0.655032       NaN  1.298510
3  0.661883       NaN -0.257437
4 -1.297187       NaN       NaN
5  0.709536       NaN       NaN

In [7]:
df.fillna(method="ffill")

/var/folders/1b/ykvrss2j11x83bff14t1qwyh0000gp/T/ipykernel_88420/3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0  0.455492  1.862006 -1.377001
1  1.744132 -0.142659  0.654927
2  0.655032 -0.142659  1.298510
3  0.661883 -0.142659 -0.257437
4 -1.297187 -0.142659 -0.257437
5  0.709536 -0.142659 -0.257437

## 7.2 Data Transfromation

In [8]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"], "k2": [1, 1, 2, 3, 3, 4, 4]})

In [9]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [10]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [11]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [12]:
data["v1"] = range(7)

In [13]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [16]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [17]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [18]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon", "pastrami", "corned beef", "bacon", "pastrami", "honey ham", "nova lox"], "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [19]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [20]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [21]:
data["animal"] = data["food"].map(meat_to_animal)

In [22]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [24]:
def get_animal(x):
    return meat_to_animal[x]

In [26]:
get_animal("bacon")

'pig'

In [27]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [28]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [29]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [30]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [31]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [32]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [33]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

Renaming Axis Indexes

In [34]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index = ["Ohio", "Colorado", "New York"], columns = ["one", "two", "three", "four"])

In [36]:
def transform(x):
    return x[:4].upper()

In [37]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [38]:
data.index = data.index.map(transform)

In [39]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [40]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [41]:
data.rename(index={"OHIO": "INDIANA"}, columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

### Discretization and Binning

In [42]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [43]:
bins = [18, 25, 35, 60, 100]

In [44]:
age_categories = pd.cut(ages, bins)

In [45]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [46]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [47]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [48]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [49]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [50]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [51]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [52]:
data = np.random.uniform(size=20)

In [53]:
pd.cut(data, 4, precision=2)

[(0.24, 0.46], (0.68, 0.89], (0.46, 0.68], (0.24, 0.46], (0.24, 0.46], ..., (0.46, 0.68], (0.021, 0.24], (0.68, 0.89], (0.24, 0.46], (0.24, 0.46]]
Length: 20
Categories (4, interval[float64, right]): [(0.021, 0.24] < (0.24, 0.46] < (0.46, 0.68] < (0.68, 0.89]]

In [54]:
data = np.random.standard_normal(1000)

In [55]:
quartiles = pd.qcut(data, 4, precision=2)

In [56]:
quartiles

[(0.0037, 0.7], (0.7, 3.25], (0.7, 3.25], (-2.8699999999999997, -0.65], (-0.65, 0.0037], ..., (0.7, 3.25], (-2.8699999999999997, -0.65], (-0.65, 0.0037], (0.7, 3.25], (0.0037, 0.7]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.8699999999999997, -0.65] < (-0.65, 0.0037] < (0.0037, 0.7] < (0.7, 3.25]]

In [57]:
pd.value_counts(quartiles)

/var/folders/1b/ykvrss2j11x83bff14t1qwyh0000gp/T/ipykernel_88420/3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-2.8699999999999997, -0.65]    250
(-0.65, 0.0037]                 250
(0.0037, 0.7]                   250
(0.7, 3.25]                     250
Name: count, dtype: int64

### Detecting and Filtering Outliers

In [58]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [59]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000001    -0.008500     0.009372    -0.028922
std       1.005130     1.016985     0.998258     0.994569
min      -3.177289    -3.514261    -3.327650    -2.980422
25%      -0.653440    -0.664538    -0.669627    -0.638592
50%       0.025337    -0.040150     0.001439    -0.031673
75%       0.701347     0.661253     0.689523     0.639635
max       2.960694     3.054815     2.750346     3.082568

In [60]:
col = data[2]

In [61]:
col[col.abs() > 3]

225   -3.227185
495   -3.122072
741   -3.327650
Name: 2, dtype: float64

In [62]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
164  2.446577  0.421054 -1.898459  3.082568
225 -0.016787  0.258601 -3.227185  0.498006
239 -3.113194 -0.473112 -1.301758  0.022642
448  0.262267  3.054815  0.710451 -0.938948
495  0.666927 -0.165912 -3.122072  0.437473
620 -3.177289  1.342786  1.358685 -0.596930
697 -0.373448 -3.514261  1.898871  0.949281
710  0.246217 -3.494287  1.291326 -0.796545
741 -0.136540  0.696574 -3.327650  0.395217
765  1.775351 -3.463172 -1.120232 -1.819421
812 -3.020135 -1.878339  1.047581  0.287814

In [63]:
data[data.abs() > 3] = np.sign(data) * 3

In [64]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000310    -0.007083     0.010049    -0.029005
std       1.004179     1.012119     0.996126     0.994314
min      -3.000000    -3.000000    -3.000000    -2.980422
25%      -0.653440    -0.664538    -0.669627    -0.638592
50%       0.025337    -0.040150     0.001439    -0.031673
75%       0.701347     0.661253     0.689523     0.639635
max       2.960694     3.000000     2.750346     3.000000

In [65]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0 -1.0 -1.0  1.0
2  1.0  1.0 -1.0 -1.0
3 -1.0  1.0 -1.0 -1.0
4 -1.0 -1.0 -1.0  1.0